In [3]:
import pandas

In [4]:
df = pandas.read_csv('quakes.csv')
df_schema = pandas.read_csv('schema.csv')

# MEAN MAGNITUDE
median for example is an aggregiate function

In [5]:
df['MAGNITUDE']

0         5.3
1         5.7
2         4.5
3         5.0
4         5.8
         ...
313395    0.6
313396    1.5
313397    1.0
313398    1.0
313399    1.2
Name: MAGNITUDE, Length: 313400, dtype: float64

In [6]:
df['MAGNITUDE'].head(15)

0     5.3
1     5.7
2     4.5
3     5.0
4     5.8
5     5.2
6     4.9
7     4.2
8     4.4
9     5.8
10    5.4
11    3.9
12    5.3
13    7.0
14    4.3
Name: MAGNITUDE, dtype: float64

In [7]:
df['MAGNITUDE'].median() # ignores NaN

2.3

# GROUPING
median magnitude by year

In [8]:
df.median() # check out, no months (of course, no sense)

YEAR         2013.00
DAY            16.00
HOUR           12.00
MINUTE         29.00
SECOND         29.90
LATITUDE       38.20
LONGITUDE      22.16
DEPTH          13.00
MAGNITUDE       2.30
dtype: float64

general feel, broad overview

In [9]:
df.describe() # again, no month, non-numerical

,YEAR,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
count,313400.000000,313400.000000,313400.000000,313400.000000,313400.000000,313400.000000,313400.000000,313400.000000,313400.000000
mean,2010.345603,15.796264,11.658440,29.436490,29.889154,37.949128,22.807047,16.377189,2.351584
std,9.831270,8.725064,7.421301,17.285351,17.318065,1.502103,2.053178,12.302358,0.844349
min,1964.000000,1.000000,0.000000,0.000000,0.000000,33.100000,14.655700,0.000000,0.000000
25%,2009.000000,8.000000,5.000000,14.000000,14.900000,37.270000,21.260000,10.000000,1.700000
50%,2013.000000,16.000000,12.000000,29.000000,29.900000,38.200000,22.160000,13.000000,2.300000
75%,2016.000000,23.000000,18.000000,44.000000,44.900000,38.730000,23.840000,21.000000,3.000000
max,2021.000000,31.000000,23.000000,59.000000,59.900000,43.680000,35.030000,244.000000,7.000000

main is very much affected by outliers, that's why median

In [10]:
df['MAGNITUDE'].describe()

count    313400.000000
mean          2.351584
std           0.844349
min           0.000000
25%           1.700000
50%           2.300000
75%           3.000000
max           7.000000
Name: MAGNITUDE, dtype: float64

In [11]:
df.count()

YEAR         313400
MONTH        313400
DAY          313400
HOUR         313400
MINUTE       313400
SECOND       313400
LATITUDE     313400
LONGITUDE    313400
DEPTH        313400
MAGNITUDE    313400
dtype: int64

In [12]:
df['DEPTH'].value_counts()

10     36504
5      20438
12     16806
11     15948
13     14889
       ...
178        1
174        1
173        1
168        1
244        1
Name: DEPTH, Length: 202, dtype: int64

very interesting, many quakes reported in 10m depth

In [13]:
df['DEPTH']

0         10
1         10
2         10
3         10
4         10
          ..
313395     5
313396     5
313397     8
313398     6
313399     7
Name: DEPTH, Length: 313400, dtype: int64

In [54]:
df_schema

      COLUMN                   ATTRIBUTE
0       YEAR       event Date: Year XXXX
1      MONTH      event Date: Month abbr
2        DAY             event Date: Day
3       HOUR  event Time (GMT): Hour 24h
4     MINUTE    event Time (GMT): Minute
5     SECOND    event Time (GMT): Second
6   LATITUDE          event Latitude (N)
7  LONGITUDE         event Longitude (E)
8      DEPTH            event Depth (km)
9  MAGNITUDE          event Magnitude Mr

In [63]:
df_schema.set_index('COLUMN', inplace=True)

In [64]:
df_schema.loc['DEPTH'] # .loc takes a filter of an index

ATTRIBUTE    event Depth (km)
Name: DEPTH, dtype: object

In [65]:
df.value_counts()

YEAR  MONTH  DAY  HOUR  MINUTE  SECOND  LATITUDE  LONGITUDE  DEPTH  MAGNITUDE
2021  MAR    31   23    52      38.9    39.7096   22.1828    6      2.5          1
2011  APR    7    19    8       52.9    38.3900   21.9200    8      1.2          1
                  14    7       1.7     38.5000   22.2700    11     1.1          1
                  15    28      10.6    35.6000   21.9100    6      3.4          1
                        39      23.1    34.9400   23.3100    8      2.9          1
                                                                                ..
2015  JUL    12   9     13      33.2    38.1400   20.5100    7      1.9          1
                  10    7       15.6    38.9800   23.4000    11     1.7          1
                        33      10.5    38.2900   20.4500    12     1.7          1
                        55      8.1     39.0100   26.2100    28     2.0          1
1964  APR    11   16    0       0.0     39.7500   25.2500    10     5.7          1
Length: 313400, dtype: int64

In [66]:
df['DEPTH'].value_counts()

10     36504
5      20438
12     16806
11     15948
13     14889
       ...
178        1
174        1
173        1
168        1
244        1
Name: DEPTH, Length: 202, dtype: int64

# NORMALIZE

In [67]:
df['DEPTH'].value_counts(normalize=True)

10     0.116477
5      0.065214
12     0.053625
11     0.050887
13     0.047508
         ...
178    0.000003
174    0.000003
173    0.000003
168    0.000003
244    0.000003
Name: DEPTH, Length: 202, dtype: float64

In [68]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

## GROUP BY FUNCTION
### split -> apply function -> combine results

In [69]:
df['YEAR']

0         1964
1         1964
2         1964
3         1964
4         1964
          ...
313395    2021
313396    2021
313397    2021
313398    2021
313399    2021
Name: YEAR, Length: 313400, dtype: int64

In [70]:
df['YEAR'].value_counts()

2014    29333
2013    23916
2012    23375
2015    22336
2019    20538
2011    18893
2016    16822
2017    16201
2020    15937
2010    15807
2018    14899
2009    12471
2008     9148
2021     6990
2007     5907
2005     5566
2006     5410
2004     3439
2003     2977
1997     2798
1995     2782
2001     2668
1996     2625
1999     2490
1998     2483
2002     2390
2000     2281
1990     1697
1981     1505
1983     1380
1993     1266
1982     1158
1991     1016
1994     1002
1992      984
1986      937
1984      888
1980      821
1989      811
1975      786
1974      738
1968      683
1972      672
1988      668
1976      643
1985      597
1977      553
1970      541
1969      522
1987      515
1979      515
1973      507
1978      477
1971      413
1967      322
1966      190
1965       91
1964       20
Name: YEAR, dtype: int64

the majority of the measurements are from 2014

In [71]:
df_schema.loc['YEAR']

ATTRIBUTE    event Date: Year XXXX
Name: YEAR, dtype: object

### split the object
group all the results by year

In [73]:
df.groupby(['YEAR'])

so, we get back a DataFrame object

In [78]:
year_grp = df.groupby(['YEAR'])

In [81]:
year_grp.get_group(1983)

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
11157,1983,JAN,2,1,18,51.5,38.58,25.40,40,3.2
11158,1983,JAN,2,6,20,2.4,37.32,20.56,5,4.3
11159,1983,JAN,3,0,12,32.4,34.91,24.53,93,4.8
11160,1983,JAN,3,14,20,43.7,36.05,21.75,10,3.7
11161,1983,JAN,4,3,58,35.9,36.30,21.67,10,3.6
...,...,...,...,...,...,...,...,...,...,...
12532,1983,DEC,28,8,27,28.7,40.87,20.93,5,4.3
12533,1983,DEC,29,4,28,16.7,37.26,20.86,5,3.5
12534,1983,DEC,29,10,39,52.9,37.70,20.05,5,3.9
12535,1983,DEC,31,6,36,2.2,35.34,26.40,5,4.1
12536,1983,DEC,31,14,30,31.9,38.24,21.86,26,3.1

the same as creating filter and using .loc

In [83]:
filt = df['YEAR'] == 1983
df.loc[filt]

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
11157,1983,JAN,2,1,18,51.5,38.58,25.40,40,3.2
11158,1983,JAN,2,6,20,2.4,37.32,20.56,5,4.3
11159,1983,JAN,3,0,12,32.4,34.91,24.53,93,4.8
11160,1983,JAN,3,14,20,43.7,36.05,21.75,10,3.7
11161,1983,JAN,4,3,58,35.9,36.30,21.67,10,3.6
...,...,...,...,...,...,...,...,...,...,...
12532,1983,DEC,28,8,27,28.7,40.87,20.93,5,4.3
12533,1983,DEC,29,4,28,16.7,37.26,20.86,5,3.5
12534,1983,DEC,29,10,39,52.9,37.70,20.05,5,3.9
12535,1983,DEC,31,6,36,2.2,35.34,26.40,5,4.1
12536,1983,DEC,31,14,30,31.9,38.24,21.86,26,3.1

but we have split everything, we can apply function

so let's find the number of earthquakes by year

In [85]:
year_grp.size()

YEAR
1964       20
1965       91
1966      190
1967      322
1968      683
1969      522
1970      541
1971      413
1972      672
1973      507
1974      738
1975      786
1976      643
1977      553
1978      477
1979      515
1980      821
1981     1505
1982     1158
1983     1380
1984      888
1985      597
1986      937
1987      515
1988      668
1989      811
1990     1697
1991     1016
1992      984
1993     1266
1994     1002
1995     2782
1996     2625
1997     2798
1998     2483
1999     2490
2000     2281
2001     2668
2002     2390
2003     2977
2004     3439
2005     5566
2006     5410
2007     5907
2008     9148
2009    12471
2010    15807
2011    18893
2012    23375
2013    23916
2014    29333
2015    22336
2016    16822
2017    16201
2018    14899
2019    20538
2020    15937
2021     6990
dtype: int64

In [90]:
df['YEAR'].value_counts()

2014    29333
2013    23916
2012    23375
2015    22336
2019    20538
2011    18893
2016    16822
2017    16201
2020    15937
2010    15807
2018    14899
2009    12471
2008     9148
2021     6990
2007     5907
2005     5566
2006     5410
2004     3439
2003     2977
1997     2798
1995     2782
2001     2668
1996     2625
1999     2490
1998     2483
2002     2390
2000     2281
1990     1697
1981     1505
1983     1380
1993     1266
1982     1158
1991     1016
1994     1002
1992      984
1986      937
1984      888
1980      821
1989      811
1975      786
1974      738
1968      683
1972      672
1988      668
1976      643
1985      597
1977      553
1970      541
1969      522
1987      515
1979      515
1973      507
1978      477
1971      413
1967      322
1966      190
1965       91
1964       20
Name: YEAR, dtype: int64

what is the most popular month by year?

In [96]:
filt = (df['YEAR'] == 1983)
df.loc[filt]['MONTH'].value_counts()

JAN    258
MAR    203
AUG    177
FEB    138
APR    136
SEP    106
MAY    103
NOV     54
JUL     54
OCT     51
JUN     50
DEC     50
Name: MONTH, dtype: int64

so the most quakes in 1983 happened in JAN

now I want the results for EVERY year

In [98]:
year_grp['MONTH'].value_counts().head(50)

YEAR  MONTH
1964  APR        6
      OCT        5
      JUL        3
      NOV        2
      AUG        1
      DEC        1
      FEB        1
      MAY        1
1965  DEC       22
      OCT       18
      NOV       15
      SEP       15
      MAR        6
      JAN        4
      AUG        3
      JUL        3
      FEB        2
      MAY        2
      APR        1
1966  JUN       25
      JUL       24
      FEB       23
      MAY       22
      SEP       20
      MAR       19
      APR       17
      JAN       16
      AUG       15
      OCT        6
      DEC        2
      NOV        1
1967  MAR       47
      JUN       42
      MAY       41
      DEC       33
      JUL       29
      SEP       29
      NOV       25
      OCT       25
      APR       22
      AUG       21
      JAN        5
      FEB        3
1968  FEB      133
      MAR       93
      JUL       92
      OCT       60
      APR       54
      MAY       45
      SEP       41
Name: MONTH, dtype: int64

this returns a series with multiple indices

so what is in 1983 the results?

In [108]:
year_grp['MONTH'].value_counts().loc[1983]

MONTH
JAN    258
MAR    203
AUG    177
FEB    138
APR    136
SEP    106
MAY    103
JUL     54
NOV     54
OCT     51
DEC     50
JUN     50
Name: MONTH, dtype: int64

In [109]:
year_grp['MONTH'].value_counts(normalize=True).loc[1983]

MONTH
JAN    0.186957
MAR    0.147101
AUG    0.128261
FEB    0.100000
APR    0.098551
SEP    0.076812
MAY    0.074638
JUL    0.039130
NOV    0.039130
OCT    0.036957
DEC    0.036232
JUN    0.036232
Name: MONTH, dtype: float64

more traditional aggregation functions

find the median magnitude of earthquakes by year

In [122]:
year_grp['MAGNITUDE'].median()

YEAR
1964    4.95
1965    4.00
1966    3.90
1967    3.70
1968    3.60
1969    3.70
1970    3.60
1971    3.50
1972    3.60
1973    3.40
1974    3.30
1975    3.30
1976    3.40
1977    3.30
1978    3.60
1979    3.50
1980    3.40
1981    3.50
1982    3.30
1983    3.60
1984    3.30
1985    3.40
1986    3.30
1987    3.40
1988    3.50
1989    3.20
1990    3.20
1991    3.20
1992    3.20
1993    3.20
1994    3.40
1995    3.10
1996    3.40
1997    3.30
1998    3.20
1999    3.20
2000    3.30
2001    3.30
2002    3.20
2003    3.30
2004    3.10
2005    3.10
2006    3.20
2007    3.20
2008    3.10
2009    3.00
2010    2.80
2011    1.80
2012    1.60
2013    1.80
2014    1.80
2015    1.80
2016    1.90
2017    1.90
2018    2.20
2019    2.00
2020    2.00
2021    1.90
Name: MAGNITUDE, dtype: float64

now find the median magnitude by month

In [123]:
month_grp = df.groupby('MONTH')

In [131]:
month_grp['MAGNITUDE'].median()

MONTH
APR    2.2
AUG    2.4
DEC    2.3
FEB    2.3
JAN    2.5
JUL    2.3
JUN    2.3
MAR    2.2
MAY    2.3
NOV    2.4
OCT    2.3
SEP    2.2
Name: MAGNITUDE, dtype: float64

### multiple aggregate functions

In [133]:
year_grp['MAGNITUDE'].agg(['median', 'mean'])

      median      mean
YEAR
1964    4.95  5.055000
1965    4.00  4.043956
1966    3.90  3.955789
1967    3.70  3.678261
1968    3.60  3.622108
1969    3.70  3.716475
1970    3.60  3.543808
1971    3.50  3.514770
1972    3.60  3.525595
1973    3.40  3.470809
1974    3.30  3.360840
1975    3.30  3.369720
1976    3.40  3.441369
1977    3.30  3.382640
1978    3.60  3.620335
1979    3.50  3.617864
1980    3.40  3.454202
1981    3.50  3.615415
1982    3.30  3.386097
1983    3.60  3.557754
1984    3.30  3.430743
1985    3.40  3.438023
1986    3.30  3.355496
1987    3.40  3.467767
1988    3.50  3.519461
1989    3.20  3.339334
1990    3.20  3.258633
1991    3.20  3.247441
1992    3.20  3.336992
1993    3.20  3.326303
1994    3.40  3.446806
1995    3.10  3.178145
1996    3.40  3.407886
1997    3.30  3.344996
1998    3.20  3.308176
1999    3.20  3.261847
2000    3.30  3.295134
2001    3.30  3.328486
2002    3.20  3.283180
2003    3.30  3.306046
2004    3.10  3.117621
2005    3.10  3.157007
2006    3.20  3.200351
2007    3.20  3.228610
2008    3.10  3.096251
2009    3.00  2.928923
2010    2.80  2.825628
2011    1.80  1.881406
2012    1.60  1.725181
2013    1.80  1.830260
2014    1.80  1.897491
2015    1.80  1.887876
2016    1.90  1.928130
2017    1.90  2.014715
2018    2.20  2.262776
2019    2.00  2.067197
2020    2.00  2.109374
2021    1.90  1.973991

what percentage of earthquakes have magnitude > 5 by each year?

step 1: group dataframe by year:

In [135]:
year_grp = df.groupby(['YEAR'])

step 2: see the earthquakes by year:

In [137]:
year_grp['MAGNITUDE'].value_counts()

YEAR  MAGNITUDE
1964  4.4          2
      4.5          2
      4.9          2
      5.3          2
      5.8          2
                  ..
2021  5.2          2
      0.1          1
      5.0          1
      5.9          1
      6.0          1
Name: MAGNITUDE, Length: 2207, dtype: int64

step 3: now use .apply and do the math

In [175]:
year_grp['MAGNITUDE'].apply(lambda x: (((x > 0.0).sum() - (x < 5.0).sum())/((x > 0.0).sum()))*100)

YEAR
1964    50.000000
1965     7.692308
1966     4.210526
1967     1.552795
1968     1.903367
1969     3.256705
1970     0.924214
1971     0.242131
1972     1.041667
1973     0.788955
1974     0.271003
1975     1.653944
1976     0.933126
1977     0.904159
1978     1.048218
1979     1.747573
1980     0.730816
1981     1.395349
1982     0.431779
1983     1.376812
1984     0.563063
1985     1.340034
1986     0.426894
1987     0.776699
1988     0.898204
1989     0.616523
1990     0.176783
1991     0.196850
1992     0.609756
1993     0.473934
1994     0.798403
1995     0.215672
1996     0.190476
1997     0.285919
1998     0.281917
1999     0.160643
2000     0.219202
2001     0.299850
2002     0.251046
2003     0.369499
2004     0.261704
2005     0.125764
2006     0.129390
2007     0.118503
2008     0.229558
2009     0.080186
2010     0.056940
2011     0.021172
2012     0.042781
2013     0.033450
2014     0.044319
2015     0.035818
2016     0.047557
2017     0.092587
2018     0.060407
2019     0.048690
2020     0.112945
2021     0.100143
Name: MAGNITUDE, dtype: float64

In [174]:
year_grp['MAGNITUDE'].apply(lambda x: (((x > 0.0).sum() - (x < 5.0).sum())/((x > 0.0).sum()))*100).sort_values()

YEAR
2011     0.021172
2013     0.033450
2015     0.035818
2012     0.042781
2014     0.044319
2016     0.047557
2019     0.048690
2010     0.056940
2018     0.060407
2009     0.080186
2017     0.092587
2021     0.100143
2020     0.112945
2007     0.118503
2005     0.125764
2006     0.129390
1999     0.160643
1990     0.176783
1996     0.190476
1991     0.196850
1995     0.215672
2000     0.219202
2008     0.229558
1971     0.242131
2002     0.251046
2004     0.261704
1974     0.271003
1998     0.281917
1997     0.285919
2001     0.299850
2003     0.369499
1986     0.426894
1982     0.431779
1993     0.473934
1984     0.563063
1992     0.609756
1989     0.616523
1980     0.730816
1987     0.776699
1973     0.788955
1994     0.798403
1988     0.898204
1977     0.904159
1970     0.924214
1976     0.933126
1972     1.041667
1978     1.048218
1985     1.340034
1983     1.376812
1981     1.395349
1967     1.552795
1975     1.653944
1979     1.747573
1968     1.903367
1969     3.256705
1966     4.210526
1965     7.692308
1964    50.000000
Name: MAGNITUDE, dtype: float64

## check .concat on how to create new dataframes

TypeError: rename() got an unexpected keyword argument 'columns'